# GetTextStyleRef

## Description
Function GetTextStyleRef returns the text style for the referenced object. The integer returned is the internal index of the text style used by this object. &lt;BR&gt;
&lt;BR&gt;
If the text object is using class text style, this returns the effective style.  You should use the *TextStyleByClass* functions to check and preserve by-class behavior.

```pascal
FUNCTION GetTextStyleRef(objectId : HANDLE) : LONGINT;
```

```python

def vs.GetTextStyleRef(objectId):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectId|HANDLE|handle to object|

## See Also
VS Functions:
SetTextStyleRef| GetTextStyleRef| SetTextStyleRefN| GetTextStyleRefN| SetTextStyleByClass| SetTextStyleByClassN| IsTextStyleByClass| IsTextStyleByClassN

## Version
Availability: from Vectorworks 2015
## Category
* Objects - Text